#Generated by ResourceBundle Editor (http://essiembre.github.io/eclipse-rbe/)
# Errores -->

Config.advancedConfig         = Configuraci\u00F3n avanzada
Config.basicConfig            = Configuraci\u00F3n b\u00E1sica
Config.exit                   = Desconectarme
Config.h1Title                = P\u00E1gina de Configuraci\u00F3n del Proxy
Config.manageExceptionsButton = Configurar excepciones de seguridad
Config.modal1Content          = Cuando accedemos a un sitio web se env\u00EDan, entre muchas otras cosas, una cierta informaci\u00F3n relacionada con el navegador que estamos utilizando para acceder a dicho sitio. Cambiar esta informaci\u00F3n permitir\u00E1 al usuario obtener un plus de privacidad en la red.
Config.modal1Title            = Cambio de navegador
Config.modal2Content          = En la actualidad, existen multitud de sitios web que, usando ciertas t\u00E9cnicas m\u00E1s o menos complejas, permiten a un atacante robar informaci\u00F3n de los usuarios leg\u00EDtimos. Bloqueando el acceso a estos sitios web nos ahorraremos muchos problemas.
Config.modal2Title            = Navegaci\u00F3n por sitios peligrosos
Config.modal3Content          = Pese a que la mayor\u00EDa de los sitios web viven de la publicidad, en ocasiones dichos sitios rastrean al usuario en busca de informaci\u00F3n \u00FAtil que permita ofrecer productos que se ajusten m\u00E1s a dicho usuario o simplemente realizar an\u00E1lisis de mercado, atentando contra su privacidad en la red.
Config.modal3Title            = La publicidad en los sitios web
Config.modal4Content          = Muchos sitios web que aseguran ser de tem\u00E1tica para adultos atraen y se aprovechan de usuarios para inyectar alg\u00FAn tipo de virus en sus dispositivos, o robarles datos personales. Bloqueando este tipo de sitios estaremos m\u00E1s seguros.
Config.modal4Title            = Sitios web con contenido pornogr\u00E1fico
Config.modal5Content          = Esta opci\u00F3n permite bloquear la navegaci\u00F3n por sitios web creados y ubicados en Espa\u00F1a que suponen un riesgo para los usuarios, ya sea por contener alg\u00FAn tipo de software malicioso o cualquier otra actividad moralmente cuestionable que pone en riesgo la seguridad de los usuarios.
Config.modal5Title            = Sitios web espa\u00F1oles potencialmente peligrosos
Config.modal6Content          = Existen ciertas cabeceras en las respuestas entregadas por los sitios web que permitir\u00E1n a\u00F1adir un extra de seguridad durante nuestra navegaci\u00F3n.\r\nM\u00E1s informaci\u00F3n acerca de las cabeceras de seguridad: https://nullsweep.com/http-security-headers-a-complete-guide/
Config.modal6Title            = Cabeceras de seguridad HTTP
Config.modal7Content          = Una Cookie es un conjunto de informaci\u00F3n almacenada en el dispositivo del usuario que es enviada en las cabeceras de las peticiones y respuestas HTTP. Se usan normalmente para almacenar datos de la sesi\u00F3n del usuario en un sitio web, ofrecer publicidad en funci\u00F3n de los intereses del usuario, o incluso mantener un carrito de la compra en una tienda online.\r\nEl uso de Cookies es totalmente legal desde el momento en que un usuario da su consentimiento, y no tiene por qu\u00E9 suponer un peligro. Sin embargo, algunos sitios web pueden usarlas con fines publicitarios, e incluso pueden llegar a sobrecargar el navegador si almacenamos demasiadas, haciendo que funcione m\u00E1s lento de lo que deber\u00EDa.
Config.modal7Title            = Cookies
Config.modalUpdateContent     = En la aplicaci\u00F3n, de forma interna, se obtienen listas a trav\u00E9s de la red que contienen sitios web potencialmente peligrosos para nuestros dispositivos y nuestra privacidad. Actualizar frecuentemente dichas listas nos har\u00E1 estar al d\u00EDa en cuanto a las amenazas de la red se refiere.
Config.modalUpdateTitle       = Actualizaci\u00F3n de lista de sitios web
Config.option1                = Quiero hacerme pasar por...
Config.option1_Nav            = Navegador
Config.option1_OS             = Sistema operativo
Config.option2                = No quiero navegar por sitios con mala reputaci\u00F3n en Espa\u00F1a
Config.option3                = No quiero navegar por sitios potencialmente peligrosos
Config.option4                = No quiero que me rastreen sitios de publicidad
Config.option5                = No quiero visitar sitios con contenido pornogr\u00E1fico
Config.option6                = Quiero que las respuestas de los sitios web contengan las siguientes cabeceras:
Config.option7                = No quiero enviar ni recibir cookies de los sitios web que visito
Config.savePref_1             = Guardar configuraci\u00F3n
Config.savePref_2             = Guardado con \u00E9xito
Config.signin                 = Iniciar sesi\u00F3n
# Panel de configuracion-->
Config.title                  = Configurar el Proxy
Config.updateButtonState1     = Actualizar lista de sitios web
Config.updateButtonState2     = Recargando lista...
Config.welcome                = Bienvenid@

# Copyright section
Copy.text = 2019 - Trabajo Fin de Grado

Error.emailExists  = Ya existe un usuario con ese email
Error.emailLength  = La longitud del correo electr\u00F3nico no debe ser mayor de 50 caracteres
Error.emptyEmail   = El campo del correo electr\u00F3nico no puede estar vac\u00EDo
Error.emptyName    = El campo del nombre no puede estar vac\u00EDo
Error.invalidEmail = Campo de correo electr\u00F3nico inv\u00E1lido
Error.invalidName  = El campo del nombre no debe contener caracteres especiales
Error.login        = El correo o la contrase\u00F1a son incorrectos
Error.nameLength   = La longitud del nombre no debe ser mayor de 15 caracteres
Error.passLength   = La contrase\u00F1a debe ser mayor que 5 caracteres y menor que 24
Error.passNumber   = La contrase\u00F1a debe incluir al menos un n\u00FAmero

Footer.aboutContent = Este Proxy ha sido implementado y desarrollado por Pablo D\u00EDaz, estudiante de 4\u00BA curso del grado de Ingenier\u00EDa Inform\u00E1tica del Software, Oviedo.
Footer.aboutTitle   = Acerca del Proxy
# Footer
Footer.contact      = Contacto
Footer.github       = Mi GitHub
Footer.linkedin     = Mi Linkedin

Login.createAccount = Crear una cuenta
Login.email         = Correo electr\u00F3nico
Login.loginButton   = Iniciar sesi\u00F3n
Login.notRegistered = \u00BFNo registrado a\u00FAn?
Login.password      = Contrase\u00F1a
Login.skip          = Si quieres continuar sin iniciar sesi\u00F3n, 
Login.skipLink      = haz clic aqu\u00ED.
# Login
Login.title         = Iniciar sesi\u00F3n

# Modal
Modal.close = Cerrar

Nav.advancedConfig = > Configuraci\u00F3n avanzada
# Navigation
Nav.basicConfig    = > Configuraci\u00F3n b\u00E1sica

Register.alreadyRegistered = \u00BFYa registrado? 
Register.createAccount     = Crear cuenta
Register.helpContent       = Si creas una cuenta e inicias sesi\u00F3n en la aplicaci\u00F3n, podr\u00E1s guardar toda tu configuraci\u00F3n del Proxy para, en futuros inicios de sesi\u00F3n, cargarla de forma inmediata.
Register.helpTitle         = \u00BFPor qu\u00E9 crear una cuenta?
Register.logIn             = Inicia sesi\u00F3n
Register.name              = Nombre
# Register
Register.title             = Registrarse

SecurityException.message       = \u00A1Excepci\u00F3n a\u00F1adida con \u00E9xito! Ahora puede visitar el siguiente sitio web sin recibir ninguna alerta:
SecurityException.messageError  = La excepci\u00F3n de seguridad ya ha sido a\u00F1adida anteriormente (o no puede a\u00F1adirse) para el host:
SecurityException.modal8Content = Las excepciones de seguridad sobre los sitios web permiten al usuario acceder a sus sitios web favoritos sin recibir mensajes de advertencia, aunque estos cumplan o no las preferencias del usuario especificadas en la p\u00E1gina de configuraci\u00F3n del Proxy.
SecurityException.modal8Title   = Configurar excepciones de seguridad
# Security Exception Page
SecurityException.title         = \u00A1Excepci\u00F3n a\u00F1adida con \u00E9xito!
